In [1]:
import pandas as pd

# Load the Toyota sales dataset
toyota_sales_data = pd.read_csv("data/car_sales/toyota_sales_data.csv")

In [2]:
aggregations = toyota_sales_data.groupby("car_model")["sale_amount"]. \
    agg(["sum", "mean"])

In [4]:
aggregations

                    sum          mean
car_model
Camry       23515068.85  27470.874825
Corolla     18559680.22  22442.176808
Highlander  32562337.53  40002.871658
RAV4        26647722.94  30985.724349
Tacoma      28908731.32  34998.464068
Tundra      34705000.21  42478.580428

In [6]:
renamed_columns = {
    "total_sales": "sum",
    "average_sales": "mean"
}

toyota_sales_data.groupby("car_model")["sale_amount"]. \
    agg(**renamed_columns)

            total_sales  average_sales
car_model
Camry       23515068.85   27470.874825
Corolla     18559680.22   22442.176808
Highlander  32562337.53   40002.871658
RAV4        26647722.94   30985.724349
Tacoma      28908731.32   34998.464068
Tundra      34705000.21   42478.580428

In [7]:
toyota_sales_data.groupby("car_model")["sale_amount"]. \
    agg(total_sales="sum", average_sales="mean")

            total_sales  average_sales
car_model
Camry       23515068.85   27470.874825
Corolla     18559680.22   22442.176808
Highlander  32562337.53   40002.871658
RAV4        26647722.94   30985.724349
Tacoma      28908731.32   34998.464068
Tundra      34705000.21   42478.580428

In [8]:
toyota_sales_data.groupby("sale_status").agg({"sale_amount": "min", "commission_pct": "count"})

             sale_amount  commission_pct
sale_status
Cancelled       20139.53             281
Completed       20001.20            2671
Pending         20000.94             774

In [9]:
toyota_sales_data.groupby("car_model").agg(
    total_sales=("sale_amount", "sum"),
    average_sales=("sale_amount", "mean"),
    commission_pct_count=("commission_pct", "count"),
    sales_count=("sale_id", "count")
)

            total_sales  average_sales  commission_pct_count  sales_count
car_model
Camry       23515068.85   27470.874825                   612          856
Corolla     18559680.22   22442.176808                   626          827
Highlander  32562337.53   40002.871658                   614          814
RAV4        26647722.94   30985.724349                   651          860
Tacoma      28908731.32   34998.464068                   625          826
Tundra      34705000.21   42478.580428                   598          817